Revit API Introduction Labs
Lab2_1_Elements Class
 List all document elements. This is not recommended for normal use!
 The main contents of a Revit project database is its elements collection. This includes both building elements representing physical objects as well as supporting elements such as various internal definitions, families and types, which are not part of the visible building model.
 In this lab, we explore the collection of all Revit document elements and implement a second external command class Lab2_1_Elements derived from IExternalCommand in the Labs2 module. Since we do nothing to modify the database, we set this command's transaction mode to read-only.
 Since the output will be much too large for a message box, we will redirect it to a text file.
 The exercise version of the Labs2 module already references the additional required namespaces such as System.IO, and the class LabConstants defines string constants for the output filename and directory:
CopyC#
private const string _temp_dir = "C:/tmp/";
public const string FilePath = _temp_dir + "RevitElements.txt";
CopyVB.NET
Private Const _temp_dir As String = "C:/tmp/"
Public FilePath As String = _temp_dir + "RevitElements.txt"
 Returning to the Lab2_1_Elements command, start by accessing the current Revit document to read elements from and opening the output file to write to:
CopyC#
UIApplication app = commandData.Application;
Document doc = app.ActiveUIDocument.Document;
// .NET exception handling should be done everywhere,
// but will sometimes be omitted for clarity in the
// following labs unless we expect exceptions:
StreamWriter sw;
try
{
  sw = new StreamWriter( LabConstants.FilePath );
}
catch( Exception e )
{
  LabUtils.ErrorMsg( string.Format( "Cannot open '{0}': {1}",
    LabConstants.FilePath, e.Message ) );
  return Result.Failed;
}
CopyVB.NET
Dim app As UIApplication = commandData.Application
Dim doc As Document = app.ActiveUIDocument.Document
' Typical .NET error checking (should be done everywhere,
' but will be omitted for clarity in some of the following
' labs unless we expect exceptions):
Dim sw As StreamWriter
Try
    sw = New StreamWriter(LabConstants.FilePath)
Catch e As Exception
    LabUtils.ErrorMsg(String.Format("Cannot open '{0}': {1}", _
                                    LabConstants.FilePath, e.Message))
    Return Result.Failed
End Try
 In Revit 2011, we no longer have direct access to the entire unfiltered Revit elements collection, because generally the Revit API does not expect an application to ever need to iterate over all elements. To retrieve them all anyway, we need to use a trick: ask for all elements fulfilling a specific criterion and unite them with all elements NOT fulfilling the same criterion:
CopyC#
// the Revit API does not expect an application
// ever to need to iterate over all elements.
// To do so, we need to use a trick: ask for all
// elements fulfilling a specific criteria and
// unite them with all elements NOT fulfilling
// the same criteria:
FilteredElementCollector collector
  = new FilteredElementCollector( doc )
    .WhereElementIsElementType();
FilteredElementCollector collector2
  = new FilteredElementCollector( doc )
    .WhereElementIsNotElementType();
collector.UnionWith( collector2 );
CopyVB.NET
' the Revit API does not expect an application
' to ever need to iterate over all elements.
' To do so, we need to use a trick: ask for all
' elements fulfilling a specific criteria and
' unite them with all elements NOT fulfilling
' the same criteria:
Dim collector As FilteredElementCollector _
    = New FilteredElementCollector(doc) _
        .WhereElementIsElementType()
Dim collector2 As FilteredElementCollector = _
    New FilteredElementCollector(doc) _
        .WhereElementIsNotElementType()
collector.UnionWith(collector2)
 Loop over the returned elements, list some of the generic identification properties to the output file, and close it when done:
CopyC#
string s, line;
foreach( Element e in collector )
{
  line = "Id=" + e.Id.IntegerValue.ToString(); // element id
  line += "; Class=" + e.GetType().Name; // element class, i.e. System.Type
  // The element category is not implemented for all classes,
  // and may return null; for Family elements, one can sometimes
  // use the FamilyCategory property instead.
  s = string.Empty;
  if( null != e.Category )
  {
    s = e.Category.Name;
  }
  if( 0 == s.Length && e is Family && null != ((Family) e).FamilyCategory )
  {
    s = ((Family) e).FamilyCategory.Name;
  }
  if( 0 == s.Length )
  {
    s = "?";
  }
  line += "; Category=" + s;
  // The element Name has a different meaning for different classes,
  // but is mostly implemented "logically". More precise info on elements
  // can be obtained in class-specific ways.
  line += "; Name=" + e.Name;
  line += "; UniqueId=" + e.UniqueId;
  //line += "; Guid=" + GetGuid( e.UniqueId );
  sw.WriteLine( line );
}
sw.Close();
LabUtils.InfoMsg( "Element list has been written to "
  + LabConstants.FilePath + "." );
CopyVB.NET
Dim s As String, line As String
For Each e As Element In collector
    line = "Id=" + e.Id.IntegerValue.ToString()
    ' element id
    line += "; Class=" + e.[GetType]().Name
    ' element class, i.e. System.Type
    ' The element category is not implemented for all classes,
    ' and may return null; for Family elements, one can sometimes
    ' use the FamilyCategory property instead.
    s = String.Empty
    If e.Category IsNot Nothing Then
        s = e.Category.Name
    End If
    If 0 = s.Length AndAlso TypeOf e Is Family AndAlso DirectCast(e, Family).FamilyCategory IsNot Nothing Then
        s = DirectCast(e, Family).FamilyCategory.Name
    End If
    If 0 = s.Length Then
        s = "?"
    End If
    line += "; Category=" + s
    ' The element Name has a different meaning for different classes,
    ' but is mostly implemented "logically". More precise info on elements
    ' can be obtained in class-specific ways.
    line += "; Name=" + e.Name
    line += "; UniqueId=" + e.UniqueId
    'line += "; Guid=" + GetGuid( e.UniqueId );
    sw.WriteLine(line)
Next
sw.Close()
LabUtils.InfoMsg("Element list has been written to " _
                 + LabConstants.FilePath + ".")
 The Execute method can safely return a Failed result code, since the database has not been modified. This aboorts the automatic transaction that was created by the Revit API due to the automatic transaction mode attribute setting.
 Compile and link the project and update the add-in manifest file accordingly, as descibed for lab 1-2. Or load and run the command with the help of the Add-in Manager, if you prefer.
 Run the command and examine and discuss the contents of the created output file with the course instructor and your peers.
 Save the first output file under a different name, add a couple of new elements to the Revit model, run the command again to generate a new output file, and compare the two.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab2_1_Elements : IExternalCommand
Visual Basic (Declaration)
Public Class Lab2_1_Elements _
	Implements IExternalCommand
Visual C++
public ref class Lab2_1_Elements : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab2_1_Elements
See Also
Lab2_1_Elements Members
Labs Namespace